import React from 'react';

const DocumentList = () => {
    const docs = [
        "১। অনলাইনে যখাযখভাবে পূরণকৃত আবেদন পত্র।",
        "২। ১ম শ্রেণীর গেজেটেড কর্মকর্তা দ্বারা সত্যায়িত পাসপোর্টের তথ্য পাতার স্ক্যানকপি অথবা বিদেশে অবস্থানকারী বাংলাদেশী নাগরিকদের ক্ষেত্রে সংশ্লিষ্ট দেশে বাংলাদেশ দূতাবাস কর্তৃক সত্যায়িত পাসপোর্টের তথ্য পাতার স্ক্যানকপি অথবা বিদেশী নাগরিকদের ক্ষেত্রে নিজ দেশের জাস্টিস অব পিস (Justice of Peace) কর্তৃক সত্যায়িত পাসপোর্টের তথ্য পাতার স্ক্যানকপি।",
        "৩। বাংলাদেশ ব্যাংক অথবা সোনালী ব্যাংক যে কোন শাখা থেকে (১-৭৩০১-০০০১-২৬৮১) কোডে করে ৫০০/- (পাচ শত শত) টাকা মূল্যমানের ট্রেজারি চালান অথবা অনলাইনে ক্রেডিট/ডেবিট কার্ডের মাধ্যমে প্রয়োজনীয় সার্ভিস চার্জের সম ফি প্রদান।"
    ];

    return (
        <div className="bg-white rounded-b shadow-sm border border-gray-200 border-t-0 p-6">
            <ul className="space-y-4 font-bengali text-sm text-gray-700 leading-relaxed text-justify">
                {docs.map((doc, index) => (
                    <li key={index}>{doc}</li>
                ))}
            </ul>
        </div>
    );
};

export default DocumentList;
