import React from 'react';

const TermsList = () => {
    const terms = [
        "১। আবেদনকারীর কমপক্ষে ৫ মাস মেয়াদ সম্পন্ন পাসপোর্ট থাকতে হবে।",
        "২। আবেদনকারীর বর্তমান ঠিকানা হিসেবে পাসপোর্টে উল্লিখিত স্থায়ী কিরা জরুরী ঠিকানার যে কোন একটি ব্যবহার করতে হবে এবং আবেদনকারীকে অবশ্যই ঐ ঠিকানার বাসিন্দা হতে হবে।",
        "৩। মেশিন রিডেবল পাসপোর্টের (এম আর পি) এর ক্ষেত্রে যদি পাসপোর্টে ঠিকানা উল্লেখ না থাকে তবে ঠিকানার প্রমাণ স্বরূপ জাতীয় পরিচয় পত্র/জন্ম নিবন্ধন সনদপত্র/স্থানীয় ওয়ার্ড কাউন্সিলর এর সনদপত্রের ফটোকপি ১ম শ্রেণীর সরকারি গেজেটেড কর্মকর্তা দ্বারা সত্যায়িত করে দাখিল করতে হবে।",
        "৪। বিদেশে অবস্থানকারী বাংলাদেশি পাসপোর্টধারী কোন ব্যক্তির পুলিশ ক্লিয়ারেন্স সার্টিফিকেট পাওয়ার জন্য তিনি যে দেশে অবস্থান করছেন সে দেশে বাংলাদেশ দূতাবাস/হাইকমিশন কর্তৃক পাসপোর্টের তথ্য পাতার সত্যায়িত কপি তার পক্ষে আবেদনের সাথে দাখিল করতে হবে।",
        "৫। পাক্ষেনগামগি কিংবা প্রবাসী বাংলাদেশী নাগরিক এবং বাংলাদেশে বসবাস করে স্বদেশীগগনে প্রত্যাবর্তককারী বিদেশী নাগরিকদের জন্য প্রয়োজনীয় পুলিশ ক্লিয়ারেন্স এই অনলাইন সিস্টেমে মাধ্যমে ইস্যু করা হয়।",
        "৬। বিদেশগামী অথবা প্রবাসী বাংলাদেশী নাগরিক যারা বাংলাদেশ ব্যতীত অন্য কোন দেশে থেকে পাসপোর্ট ইস্যু/রিনুউ করেছেন তাদেরকে বাংলাদেশে আসার পর পুলিশ ক্লিয়ারেন্স নিতে চাইলে সর্বশেষ এ্যারাইভাল (Arrival) সীল সম্বলিত পৃষ্ঠাটি স্ক্যান কপি আবেদনের সাথে আপলোড করতে হবে।",
        "৭। প্রবাসী আবেদনকারীগণ যার মাধ্যমে পুলিশ ক্লিয়ারেন্স সনদ সংগ্রহ করতে চান তার নাম এবং জাতীয় পরিচয় পত্রের নম্বর উল্লেখ করে তাকে সভারায় পূর্বক একটি অনুমতি পত্র (Authorization Letter) আবেদনের সাথে স্ক্যান আপলোড করতে হবে। স্থানীয় আবেদনকারীর ক্ষেত্রেও অত্যন্ত জরুরী সময় সংগ্রহকারী অনুরূপ অনুমতি পত্রসহ প্রেরণ করতে হবে।",
        "৮। বাংলাদেশের অভ্যন্তরে চাকুরী কিংবা অন্য কোন কাজ করে পুলিশ ক্লিয়ারেন প্রয়োজন হলে আপনি যে জেলার বাসিন্দা উত্তর জেলা ডিএসবি অফিস অথবা আপনার ঠিকানা অনুযায়ী মেট্রোপলিটন এলাকায় হয় তাহলে উক্ত মেট্রোপলিটন এলাকার সিটি এসবি অফিসে যোগাযোগ করুন।",
        "৯। পুলিশ ডিলিয়েন্স ডেলিভারি নিতে প্রার্থীর পাসপোর্টের কপি অথবা আবেদনের কপি সাথে নিয়ে আসতে হবে। এছাড়া প্রার্থী বিদেশে থাকলে সংশ্লিষ্ট এমসি কর্তৃক সত্যায়িত/আটিস্টের অথর পিস কর্তৃক সত্যায়িত অটোর্ডাইজেশন লেটার আনতে হবে।"
    ];

    return (
        <div className="bg-white rounded-b shadow-sm border border-gray-200 border-t-0 p-6">
            <ul className="space-y-4 font-bengali text-sm text-gray-700 leading-relaxed text-justify">
                {terms.map((term, index) => (
                    <li key={index}>{term}</li>
                ))}
            </ul>
        </div>
    );
};

export default TermsList;
